## Обработка PDF с использованием Tabula

Для обработки PDF-файлов можно использовать практически ручные методы с помощью Word/Excel, но в большинстве случаев на выходе вы получите бардак из данных. Более сложный путь - программирование с помощью некоторых библиотек существующих на Python (PDFMiner) и Java (PDFBoc).
Лучший вариант — безусловно программа ABBY FineReader, но это платное ПО, которое в демо- и онлайн-режиме позволяет обработать не более 100 страниц. И непосредственно Tabula.

Tabula — это программное средство под открытой лицензией MIT для Windows, Mac and Linux, которое позволяет загружать PDF и извлекать диапазоны строк и столбцов из тафлиц, которые содержатся в документе. Tabula работает в Java-среде, поэтому требуется ее установка, если таковой еще нет на компьютере. *(Tabula для Mac OS X идет с Java из коробки)*

#### Установка

Установка не представляет никаких сложностей, при условии наличия джава среды, как сказано выше. Вам необходимо скачать с [официальног-сайта](https://tabula.technology) zip-архив и разархивировать в удобную вам директорию. 

#### Использование:

1. При запуске, откроется браузер и запустится локалхост. Tabula имеет очень простой графический интерфейс. Все что вам небходимо сделать — начать на большую зеленую кнопку "Browse", чтобы выбрать нужный документ.

2. На том же экране, в меню справа появится ваш документ. Нажмите на него, после чего документ откроется. Теперь вы можете выбрать дипазон или всю таблицу целиком для извлечения.

3. Сразу же после выделения, ваши данные откруются в новом окне. где есть опция скопировать их в буфер обмена, либо сохранить в формате CSV.

**Ограничения**  
К сожалению, табула не работает с таблицами в которых присутсвуются объедененные ячейки или другие сложные структуры.

#### tabula-py
Также существует очень проста и удобная библитека для Python — tabula-py.

Для ее работы необходимы:
* Java
* pandas
* urllib3
* distro

Библиотека имеет все те же ограничения. Плюс, нет возможности выбора диапазона извлечения. Но есть дополнение в виде сохранения данных не только в CSV, но и в TSV и JSON.

Метод главный метод — **read_pdf()**, в котором узкавается путь к файлу.
Для извлечения, не в CSV, методу необходимо прописать параметр **ouyput_format=** , например, "json". 

Для непосредственного конвертирования и сохранения есть метод 
**convert_into()**, где первый параметр — путь к PDF, второй — имя файла, который будет сохранен. Для сохранения не в CSV, также нужно прописать параметр **output_format**.

Ссылки:
1. https://source.opennews.org/en-US/articles/introducing-tabula/
2. http://tabula.technology
